<h1>Aprendendo Pandas parte 1.</h1>
<p></p>
Nessa primeira parte será focado na criação de data frame/series e acesso ao indices (colunas ou linha), bem como renomear eles.

Em Panda existe dois objetos Data Frame e Series, o primeiro objeto a ser estudo será o Series

<h2>Series</h2>

Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called index.

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a', 'b', 'c']
minha_lista = [10, 20, 30]
minha_tupla = (10, 20, 30)
array = np.array([10, 20, 30])
dic = {'a': 10, 'b': 20, 'c': 30}

In [3]:
series = pd.Series(data = minha_lista, index = labels)

In [4]:
type(series)

pandas.core.series.Series

In [5]:
series

a    10
b    20
c    30
dtype: int64

Podemos acessar da mesma forma que acessamos um dicionario, ou seja, basta passar a 'chave'.

In [6]:
series['b']

20

O parametro Data pode ser um Array, List, Tuple etc...

In [7]:
pd.Series(data = minha_tupla, index = labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data = array, index = labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data = dic)

a    10
b    20
c    30
dtype: int64

<h3>Operações Com Series</h3>

In [10]:
ser1 = pd.Series([1, 2, 3, 4], index = ['EUA', 'Alemanha', 'URSS', 'Japao'])
ser2 = pd.Series([1, 2, 3, 4], index = ['Alemanha', 'EUA', 'Italia', 'Japao'])

In [11]:
ser1

EUA         1
Alemanha    2
URSS        3
Japao       4
dtype: int64

In [12]:
ser2

Alemanha    1
EUA         2
Italia      3
Japao       4
dtype: int64

In [13]:
print(f'Matrix:\n{np.array(ser1)}')
print(f'\ndimensao:{np.array(ser1).shape}')
print(f'\nMatrix tranposta:\n{np.array(ser1).T}')
print(f'\ndimensao:{np.array(ser1).T.shape}')

Matrix:
[1 2 3 4]

dimensao:(4,)

Matrix tranposta:
[1 2 3 4]

dimensao:(4,)

In [14]:
ser1 + ser2

Alemanha    3.0
EUA         3.0
Italia      NaN
Japao       8.0
URSS        NaN
dtype: float64

Somando ser1 com ser2 e nos valores faltantes substituindo por 0

In [15]:
ser1.add(ser2, fill_value = 0)

Alemanha    3.0
EUA         3.0
Italia      3.0
Japao       8.0
URSS        3.0
dtype: float64

In [16]:
ser1.add(ser2)

Alemanha    3.0
EUA         3.0
Italia      NaN
Japao       8.0
URSS        NaN
dtype: float64

In [17]:
ser1.add(ser2, fill_value = 10)

Alemanha     3.0
EUA          3.0
Italia      13.0
Japao        8.0
URSS        13.0
dtype: float64

In [18]:
ser1 - ser2

Alemanha    1.0
EUA        -1.0
Italia      NaN
Japao       0.0
URSS        NaN
dtype: float64

In [19]:
ser1.sub(ser2, fill_value = 0)

Alemanha    1.0
EUA        -1.0
Italia     -3.0
Japao       0.0
URSS        3.0
dtype: float64

Acessando valores num Series

In [20]:
df = pd.read_csv("nba.csv")
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [21]:
serie = pd.Series(df['Name'])
serie.head(10)

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
9     Marcus Smart
Name: Name, dtype: object

In [22]:
serie.iloc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
Name: Name, dtype: object

Os valores de Italia e URSS retornaram NaN pois somaram um int/float com um NaN, pois existem um uma tabela mas não na outra.

<h2>Data Frames</h2>

In [23]:
np.random.seed(101)

O Método .seed cria uma semente para geração de números aleatorios.

In [24]:
dados = np.random.randn(5, 4)
linhas = ['A', 'B', 'C', 'D', 'E']
coluna =['W', 'X', 'Y', 'Z']
df = pd.DataFrame(data = dados, index = linhas, columns = coluna)

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
type(df)

pandas.core.frame.DataFrame

Acessando valores no df, usando df[COLUNA]

In [27]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [28]:
type(df['W'])

pandas.core.series.Series

Acessando multiplas colunas, usando df[LISTAS COM AS COLUNAS]

In [29]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

Acessando coluna usando df.COLUNA. Esse metodo de acessa não é recomendada pois pode confundir com Metodos do Pandas.
<p></p>
Criando uma nova coluna.

In [30]:
df['new'] = df['W'] + df['X'] 
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

Para deletar coluna(s) basta usar .drop(COLUNAS, axis = 1). Mudar o parametro axis = 1 é necessario?
Sim pois por default axis = 0 que indica que o metodo .drop esta olhando para as linhas, ao mudar para 1 ele passa a olhar para as colunas.

In [31]:
df.drop('new', axis = 1)
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

Note que ao usar o método .drop não salvamos um 'novo' df. Para salvar esse novo df temos duas alternativas.
<p> </p>
Primeiro método

In [32]:
df = df.drop('new', axis = 1)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df['new'] = df['W'] + df['X'] 
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

Segundo método, basta fazer inplace = True

In [34]:
df.drop('new', axis = 1, inplace = True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Localizando elementos por indices. Para fazermos isso temos 3 formas, sendo que uma forma já foi vista anteriormente.
<p> </p>
Primeiro método, usando metodo loc.

In [35]:
df.loc['A', 'W']

2.706849839399938

In [36]:
type(df.loc['A', 'W'])

numpy.float64

In [37]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [38]:
type(df.loc['A'])

pandas.core.series.Series

In [39]:
df.loc[['A', 'B'], ['X', 'Y', 'Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965

Segunda forma, usando método iloc.

In [40]:
df.iloc[1:4, 2:]

          Y         Z
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057

A diferença entre o loc e o iloc é que um utiliza-se dos indices das linhas e colunas e o outro usa as posiçoes, sendo este ultimo muito parecido com a forma de acesso do Numpy.

<h2>Seleção Condicional</h2>
<p> </p>
Vamos utilizar o dataframe df, já salvo anteriormente

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
boleano = df > 0

In [43]:
df[boleano]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

Excluindo os valores que são da coluna W maiores do que 0.

In [44]:
df[df['W'] > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Pegando os valores da coluna Y do dataframe anterior. Temos duas formas!!!
<p></p>
Primeira forma.

In [45]:
df[df['W'] > 0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

Segunda forma.

In [46]:
bol = df['W'] > 0
df2 = df[bol]
df2['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

Fazendo filtros condicionais com multiplas condições.
<p></p>
Na hora de fazer as condições usar o & e não and e | no lugar de or !!!!

In [47]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [49]:
data = pd.DataFrame({'key': ['K0', 'K0', 'K1', 'K2','K0', 'K0', 'K0', 'K0'],
                        'A': ['A0', 'A1', 'A2', 'A3','A0', 'A1', 'A20', 'A13'],
                        'B': ['B0', 'B1', 'B2', 'B3','D0', 'D1', 'D2', 'D3']})
data[(data['key'] == 'K0') | (data['B'] == 'D3')]

  key    A   B
0  K0   A0  B0
1  K0   A1  B1
4  K0   A0  D0
5  K0   A1  D1
6  K0  A20  D2
7  K0  A13  D3

In [50]:
data[(data['key'] == 'K0') & (data['B'] == 'D3')]

  key    A   B
7  K0  A13  D3

<h3>Mudando os indices</h3>

O método <b>reset_index</b> ele altera o index, das linhas, que é passado como parametro na hora de criar o dataframe, e por default o novo index sera numeros que começam no 0. Alem de mudar o index das linhas ele coloca o antigo index como uma nova coluna. Este método tbm possui o parametro inplace. Um forma de alterar o renomar o index sem ser por números é usar o método set_index.

In [51]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [52]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df.reset_index(inplace = True)

In [54]:
df

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

Mudando o default do reset_index.

In [55]:
df = pd.DataFrame(data = dados, index = linhas, columns = coluna)
col_nova = ['RS', 'RJ', 'SP', 'AM', 'SC']
df['Estado'] = col_nova

In [56]:
df

          W         X         Y         Z Estado
A  2.706850  0.628133  0.907969  0.503826     RS
B  0.651118 -0.319318 -0.848077  0.605965     RJ
C -2.018168  0.740122  0.528813 -0.589001     SP
D  0.188695 -0.758872 -0.933237  0.955057     AM
E  0.190794  1.978757  2.605967  0.683509     SC

In [57]:
df.set_index(keys = 'Estado', inplace = True)

In [58]:
df

               W         X         Y         Z
Estado
RS      2.706850  0.628133  0.907969  0.503826
RJ      0.651118 -0.319318 -0.848077  0.605965
SP     -2.018168  0.740122  0.528813 -0.589001
AM      0.188695 -0.758872 -0.933237  0.955057
SC      0.190794  1.978757  2.605967  0.683509

<h2>Indices Multiniveis</h2>

In [59]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [60]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [61]:
df = pd.DataFrame(np.random.randn(6, 2), index = hier_index, columns = ['A', 'B'])

In [62]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

Podemos pensar que G1 e G2 são Estados os números 1, 2, 3 níveis de escolaridade e A e B são taxas de violência.

Dado nome para grupo inside e o outside.

In [63]:
df.index.names = ['Grupo', 'Numero']

In [64]:
df

                     A         B
Grupo Numero
G1    1       0.302665  1.693723
      2      -1.706086 -1.159119
      3      -0.134841  0.390528
G2    1       0.166905  0.184502
      2       0.807706  0.072960
      3       0.638787  0.329646

Acessando valores desse dataframe.

In [65]:
df.loc['G1']

               A         B
Numero
1       0.302665  1.693723
2      -1.706086 -1.159119
3      -0.134841  0.390528

In [66]:
df.loc['G2']

               A         B
Numero
1       0.166905  0.184502
2       0.807706  0.072960
3       0.638787  0.329646

In [67]:
df.xs('G1')

               A         B
Numero
1       0.302665  1.693723
2      -1.706086 -1.159119
3      -0.134841  0.390528

In [68]:
df.xs(1, level = 'Numero')

              A         B
Grupo
G1     0.302665  1.693723
G2     0.166905  0.184502

A vantagem do metodo xs é ter o parametro xs que permite pular o indice outside (externo).